
<!-- header -->
```fish
plan -chdir=terraform/development -lock=false
```
<!-- fmt -->

<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
+ aws_instance.grafana_server will be created
+ aws_security_group.grafana_sg will be created
+ aws_vpc_security_group_egress_rule.grafana_egress will be created
+ aws_vpc_security_group_ingress_rule.grafana_ingress will be created
```
</details>
<!-- main -->
<details><summary>Plan: 4 to add, 0 to change, 0 to destroy.</br>

###### Terraform CI by @chris3ware via [pull_request](https://github.com/3ware/gitops-2024/actions/runs/11438613373/job/31820564034) at 2024-10-21T10:54:10Z.
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.grafana_server will be created
  + resource "aws_instance" "grafana_server" {
      + ami                                  = "ami-005fc0f236362e99f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0ab2e511bfeaa6294"
      + tags                                 = {
          + "Name" = "grafana-server-development"
        }
      + tags_all                             = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "grafana-server-development"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "829fb476176e8de655d5449a8790a17650f3af0e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_security_group.grafana_sg will be created
  + resource "aws_security_group" "grafana_sg" {
      + arn                    = (known after apply)
      + description            = "Grafana Server security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "grafana_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
        }
      + vpc_id                 = "vpc-0c70bc56292259892"
    }

  # aws_vpc_security_group_egress_rule.grafana_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "grafana_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Outbound traffic from grafana server"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "grafana-egress-sg-rule-development"
        }
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "grafana-egress-sg-rule-development"
        }
    }

  # aws_vpc_security_group_ingress_rule.grafana_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "grafana_ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Inbound traffic to grafana web interface"
      + from_port              = 3000
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "grafana-ingress-sg-rule-development"
        }
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "gitops-2024"
          + "3ware:workspace"            = "app-us-east-1-development"
          + "Name"                       = "grafana-ingress-sg-rule-development"
        }
      + to_port                = 3000
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + grafana_ip     = (known after apply)

```
</details>
<!-- footer -->
<!-- terraform.18.-chdir-terraform-development.-out-tfplan -->